In [6]:
import pandas as pd

data1 = {
  "Roll-No": [23, 15,10,30 ],
  "Student-Name": ["Krupa", 'Disha', 'Aarya','Misti'],
  "Marks":[90,89,91,88]
}

df = pd.DataFrame(data1)
print(df)

   Roll-No Student-Name  Marks
0       23        Krupa     90
1       15        Disha     89
2       10        Aarya     91
3       30        Misti     88

In [7]:
#refer to the row index:
print(df.loc[1])

Roll-No            15
Student-Name    Disha
Marks              89
Name: 1, dtype: object

In [8]:
print(df.loc[[0, 1]])

   Roll-No Student-Name  Marks
0       23        Krupa     90
1       15        Disha     89

In [10]:
#Named Index
import pandas as pd

data2 = {
  "Student-Name": ["Krupa", 'Disha', 'Aarya','Misti'],
  "Marks":[90,89,91,88]
}

df2 = pd.DataFrame(data2, index = ["1", "2", "3","4"])

print(df2)

  Student-Name  Marks
1        Krupa     90
2        Disha     89
3        Aarya     91
4        Misti     88

In [11]:
#access row using index name
print(df2.loc["3"])

Student-Name    Aarya
Marks              91
Name: 3, dtype: object

In [15]:
#Dataframe in table-style
from IPython.display import display 
import pandas as pd 

data1 = {
  "Roll-No": [23, 15,10,30 ],
  "Name": ["Krupa", 'Disha', 'Aarya','Misti'],
  "Marks":[90,89,91,88]
}

df1 = pd.DataFrame(data1)

display(df1)

   Roll-No   Name  Marks
0       23  Krupa     90
1       15  Disha     89
2       10  Aarya     91
3       30  Misti     88